app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO `users` (`name`, `email`, `dob`, `created_at`, `updated_at`, `password_digest`) VALUES ('Anil', 'jds@ds.com', '2016-08-06', '2016-08-05 18:13:42', '2016-08-05 18:13:42', '$2a$10$3DDnd27VLanX18QFk4KPXu1NVju8NGY29w7hhqlzYU7v.yziPb2Iu')